# Wonth-01
# Week-01
# Day-07

# 1-یک ماتریس 2×3 و یک بردار طول 3 بساز
import numpy as np
p=print
np.random.seed(2)
m=np.random.randint(-15,37,(3,2))
v=np.random.randint(-20,40,size=3)

# 2-با broadcasting آن‌ها را جمع کن و نتیجه را تحلیل کن
p(m.shape)
p(v.shape)
'''
ابعاد ماتریس:
(3,2)
ابعاد بردار:
(3,) 
 نامپی که بعنی  در ذهن 
(1,3)
'''
# از مقایسه ابعاد این دو آرایه میفهمیم که با هم سازگار نیستند 
# و بردار نیاز به ریشیپ دارد
v_col = v.reshape(3,1)

p(m + v_col)
'''
با پرینت بردار اولیه و بردار ریشیپ شده میتوان دید 
در ابتدا به این شکل بوده :
[-2 -9 20]

ولی بعد از ریشیپ به حالت ستونی و به این صورت در آمده 
[[-2]
 [-9]
 [20]]
 
تا قادر باشد به صورت ستونی یعنی از چپ به راست پخش شود 
:و محاسبه را ممکن کند به این صورت 
[[25  0]    [[-2 -2]        [[ 23  -2]
[30 -7]     [-9 -9]         [ 21 -16]
[ 7 28]] +  [20 20]]        [ 27  48]]

matrix      v_reshape  = 
'''
