# Month-01
# Week-01
# Day-07

# 1-یک ماتریس 2×3 و یک بردار طول 3 بساز
import numpy as np
p=print
np.random.seed(2)
m=np.random.randint(-15,37,(3,2))
v=np.random.randint(-20,40,size=3)

# 2-با broadcasting آن‌ها را جمع کن و نتیجه را تحلیل کن
p(m.shape)
p(v.shape)
'''
ابعاد ماتریس:
(3,2)
ابعاد بردار:
(3,) 
 نامپی که بعنی  در ذهن 
(1,3)
'''
# از مقایسه ابعاد این دو آرایه میفهمیم که با هم سازگار نیستند 
# و بردار نیاز به ریشیپ دارد
v_col = v.reshape(3,1)

p(m + v_col)
'''
با پرینت بردار اولیه و بردار ریشیپ شده میتوان دید 
در ابتدا به این شکل بوده :
[-2 -9 20]

ولی بعد از ریشیپ به حالت ستونی و به این صورت در آمده 
[[-2]
 [-9]
 [20]]
 
تا قادر باشد به صورت ستونی یعنی از چپ به راست پخش شود 
:و محاسبه را ممکن کند به این صورت 
[[25  0]    [[-2 -2]        [[ 23  -2]
[30 -7]     [-9 -9]         [ 21 -16]
[ 7 28]] +  [20 20]]        [ 27  48]]

matrix      v_reshape  = 
'''

p("--------Weekly excercise-----------------")
# مأموریت پایان هفته (ارزیابی یادگیری)

# 1-۳ ماتریس مختلف بساز
import numpy as np
p = print

m1 = np.eye(4)
m2 = np.linspace(-10,40,20).reshape(5,4).astype(int)
m3 = np.arange(24).reshape(6,4)

# 2- روی هر کدام ۳ عملیات ریاضی مختلف انجام بده
# 1
p("m1 + 5: ")
p(m1 + 5)

# 2
v = np.linspace(-10,40,4).round()
p("m1 + v:")
p(m1 + v)

# 3
p("m1 + m1:")
p(m1 + m1)
p("-------------------------")
# 1
p("m2 - 10: ")
p(m2 - 10)

# 2
p("m2 - v : ")
p(m2 - v)
p("m2",m2)

# 3
m2_mean_col = np.mean(m2,axis=0)
# میانگین ستون های ماتریس ام 2
p("m2 - m2_mean_col : ")
p(m2-m2_mean_col)
# منها کردن میانگین ستونی از هر عنصر ماتریس برای نرمالسازی
p("-------------------------")
# 1
p("m3 / 6: ")
p((m3 / 6).round(1))

# 2
p("m3 * v : ")
p(m3 * v)

# 3
m3_sum_row=np.sum(m3,axis=1)
# مجموع ردیفی ماتریس سوم محاسبه شد

m3_sum_row_reshaped = m3_sum_row.reshape(6,1)
# مجموع ردیفی نیاز به ریشیپ داشت 
# تا بتواند با ماتریس سوم وارد محاسبه شود

p("m3 + m3_sum_row_reshaped : ")
p(m3 + m3_sum_row_reshaped)

# 3- نتایج و تحلیل خود را به شکل متن بنویس
'''
سه ماتریس ساختیم که تعداد ستون همه آنها برابر 4 بود
بعدها یک بردار هم ساخته شد که طولش برابر 4 بود
این موضوع سبب سازگاری ابعاد بردار با ماتریس ها شد
در هر سه ماتریس تمرین محاسباتی اول با یک عدد منفرد 
و تمرین دوم محاسبه ماتریس با یک بردار بود
در تمرین سوم، ماتریس اول با خودش جمع شد.
ماتریس دوم با میانگین ستونی خود و ماتریس سوم نیز با مجموع ردیفی 
خودش نرمالسازی شدند.
'''