# Month-02
# Week-01
# Day-01

# تمرین :
# یک تصویر انتخاب کن و نقاط مهم (گوشه ها و لبه ها) را به صورت ذهنی یا ساده مشخص کن(بدون کد)
# -----------------------------------
import cv2
p = print
path = r"E:\python\INTPCode\5_Month_Computer_Vision_Roadmap\Month-02\Week-01\Day-01\Data\fruit square.jpg"
# --------------------

img = cv2.imread(path)
cv2.imshow("win",img)
cv2.waitKey(0)
cv2.destroyAllWindows()
# ------------------------------------

'''
این تصویر که یک مکعب میوه است را انتخاب کردیم و چند کیپوینت مهم را در آن  با برنامه پینت ویندوز، علامت گذاری کردیم:
دایره های قرمز مشخص شده در تصویر گوشه ها یا کرنرها هستند
خطوط سیاه هم تعدادی از لبه های مهم در تصور هستند
البته تمامی لبه ها علامت گذاری نشده اند بلکه صرفا تعدادی از آنها
در نهایت با اپن سیوی تصویر را خواندیم
'''